In [2]:
import numpy as np
import pandas as pd

data = {
    'apples':[3, 2, 0, 1],
    'oranges':[0, 3, 7, 2]
}

pd.DataFrame(data, index=['第1','第2', '第3', '第4'])

    apples  oranges
第1       3        0
第2       2        3
第3       0        7
第4       1        2

In [3]:
data = np.random.randint(50, 101, size=(5, 5))
pd.DataFrame(data)

    0   1   2   3   4
0  91  83  61  73  78
1  55  70  57  77  86
2  90  59  61  95  54
3  84  55  77  97  56
4  72  97  73  78  95

In [4]:
data = np.random.randint(50, 101, size=(5, 5))
pd.DataFrame(data, index=['學生1', '學生2', '學生3','學生4', '學生5'])

      0   1   2   3   4
學生1  50  60  67  88  98
學生2  91  67  84  87  96
學生3  74  64  93  74  76
學生4  74  68  66  76  55
學生5  63  97  82  73  78

In [ ]:
data = np.random.randint(50, 101, size=(5, 5))
df = pd.DataFrame(data, 
        index=['學生1', '學生2', '學生3','學生4', '學生5'], 
        columns = ['國文', '英文', '數學','地理','歷史'])   #程式太長，分行處理
df

     國文   英文  數學  地理  歷史
學生1  96  100  77  62  64
學生2  83   93  94  65  54
學生3  87   53  91  60  88
學生4  75   71  66  58  57
學生5  97   78  83  98  94

In [7]:
# 依據欄位名稱的選取
df['國文']

學生1    96
學生2    83
學生3    87
學生4    75
學生5    97
Name: 國文, dtype: int32

In [8]:
df[['國文','英文']]

     國文   英文
學生1  96  100
學生2  83   93
學生3  87   53
學生4  75   71
學生5  97   78

In [18]:
#可以使用numpy的統計function
sum = np.sum(df, axis=1)
sum

學生1    399
學生2    389
學生3    379
學生4    327
學生5    450
dtype: int64

In [19]:
mean = np.mean(df, axis=1)
mean

學生1    79.8
學生2    77.8
學生3    75.8
學生4    65.4
學生5    90.0
dtype: float64

In [21]:
df['總分'] = sum
df['平均'] = mean
df

     國文   英文  數學  地理  歷史   總分    平均
學生1  96  100  77  62  64  399  79.8
學生2  83   93  94  65  54  389  77.8
學生3  87   53  91  60  88  379  75.8
學生4  75   71  66  58  57  327  65.4
學生5  97   78  83  98  94  450  90.0

In [24]:
#依據列的選取
#.loc[] >依據名稱
#.iloc[] ->這是依據索引

df.loc['學生1']
df.loc[['學生1', '學生2']]

     國文   英文  數學  地理  歷史   總分    平均
學生1  96  100  77  62  64  399  79.8
學生2  83   93  94  65  54  389  77.8

In [25]:
df.iloc[0]

國文     96.0
英文    100.0
數學     77.0
地理     62.0
歷史     64.0
總分    399.0
平均     79.8
Name: 學生1, dtype: float64

In [26]:
df.iloc[:2]

     國文   英文  數學  地理  歷史   總分    平均
學生1  96  100  77  62  64  399  79.8
學生2  83   93  94  65  54  389  77.8

In [27]:
df.iloc[0,:5]

國文     96.0
英文    100.0
數學     77.0
地理     62.0
歷史     64.0
Name: 學生1, dtype: float64

In [28]:
df.iloc[:2,:5]

     國文   英文  數學  地理  歷史
學生1  96  100  77  62  64
學生2  83   93  94  65  54